Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K30.tmx
Source language: en_us
Languages: zh_cn

source: Gifts to the Dark Gods
zh_cn: 给黑暗之神的礼物

source: The tap on her shoulder freezes her; the quiet, warning voice in her ear is exactly what she has feared.
zh_cn: 肩上的轻拍把她吓呆了；耳中那平静、警告的声音正是她所畏惧的。

source: In a small dark place inside herself she is prepared for both.
zh_cn: 在她内心深处一个小而黑暗的地方，她对这两者已经做好了准备。

source: She had not expected a teenager.
zh_cn: 她没想到是一个十几岁的少年。

source: "Come with me please, Madam," the young man says, his back stiff with self-importance.
zh_cn: “请跟我来，夫人，”年轻人说，他的背高傲地直挺着。

source: He is young enough to be her son; young enough to be one of the troubled youths she tutors in the small charity-run literacy programme in the suburbs.
zh_cn: 他的年纪小到足以做她儿子了；小到足以是郊区里那个慈善团体办的小扫盲班上她辅导的问题青年之一。

source: She is tutoring a boy now: he has a tattoo on his forehead that spells HATE and eyes that dart around the room, alert for predators.
zh_cn: 她目前正辅导一个男孩：他额头上有一个纹身，写着“恨”，他的眼睛飞快地环视房间，提防着有人掠夺他。

source: This young man, though also dark skinned and mixed-race, keeps his eyes averted.
zh_cn: 这个年轻人，尽管也是黑皮肤、混血儿，却避开了眼神。

source: He is smooth suited and smells of fresh citrus cologne as he grips her arm and leads her to the manager's office.
zh_cn: 在他紧抓她的胳膊，带她去经理的办公室时，他衣着得体，散发着清新的柑橘古龙水的味道。

source: The manager is tired and he lowers his pale lashes when he asks to see her ID, as if asking for something intimate, inappropriate.
zh_cn: 经理很疲倦了，在他要求看她的身份证时，他低下了他暗淡的眼睫毛，好像是在要某些私密的、不适当的东西。

source: Then he turns to his computer.
zh_cn: 然后他转向他的电脑。

source: Helen swallows.
zh_cn: 海伦咽了下口水。

source: This is new.
zh_cn: 这事儿从未发生过。

source: As he scrutinises the screen, then types something into the computer, fear knots her chest.
zh_cn: 在他仔细观察屏幕，然后往电脑里输进一些东西时，恐惧缠绕在她的胸膛里。

source: Her name is now accessible to every major store in the city.
zh_cn: 她的名字现在已被市里每一家大商店知晓了。

source: The next time she is caught she will be arrested and booked.
zh_cn: 下一次她被抓到，她要被逮捕并起诉。

source: No question. "Is that legal?" she asks. "Storing information on someone who hasn't even been charged?"
zh_cn: 毫无疑问。“这合法吗？”她问，“存储某个尚未被指控的人的信息？”

source: "You want to call your husband?" he replies, with a tiny smile. "Or a lawyer?"
zh_cn: “你想要打电话给你丈夫吗？”他回答道，带着一丝微笑，“或者律师？”

source: "My husband is a lawyer," Helen says.
zh_cn: “我丈夫就是律师，”海伦说。

source: The manager blinks rapidly, the smile vanishes.
zh_cn: 那个经理快速地眨眨眼，微笑消失了。

source: The young man who had escorted her from the jewellery department leans against the door and makes a small groaning sound.
zh_cn: 那个把她从珠宝部送过来的年轻人靠在门上，发出一声轻微的呻吟。

source: "He'll be very angry if I call him," Helen says. "At me. Or at you.
zh_cn: “如果我打电话给他，他会非常生气，”海伦说，“对我，或者对你。

source: I'm afraid he's likely to make a big fuss about wrongful arrest."
zh_cn: 我怕他很可能会为非法拘留大动干戈。”

source: They understand her.
zh_cn: 他们听懂了她的意思。

source: She knows they haven't called the police yet.
zh_cn: 她知道他们还没报警。

source: She is carrying a fat wad of cash in her purse, four credit cards, including a Platinum American Express and their own Valued Customer Card.
zh_cn: 她钱包里带着一大笔现金、四张信用卡，包括一张美国运通的白金卡，还有他们自己的贵宾卡。

source: She wears an emerald ring, an anniversary gift from her husband.
zh_cn: 她戴着一枚祖母绿的戒指，那是她丈夫送的周年纪念礼物。

source: The diamond studs in her ears are one caret each.
zh_cn: 她耳朵上的钻石耳钉每个是一克拉。

source: She is easily able to pay for the designer scarf and the hard plastic earrings in the shape of sunflowers she was seen to stuff into her bag.
zh_cn: 她能轻易地支付被看到塞进她包里的那条由设计师设计的围巾和那付向日葵形状的硬塑料耳环。

source: Helen knows that what most disturbs them is that these are two different items, from two separate counters.
zh_cn: 海伦知道最使他们不安的是这是两种不同的物品，分别来自两个柜台。

source: But she always steals two items.
zh_cn: 但她总是偷两件。

source: That is one of her rules.
zh_cn: 那是她的规则之一。

source: It has to be two items, from different counters, from the same floor of the same store.
zh_cn: 必须是两件，从不同的柜台，从同一家商店的同一楼层。

source: But they want to let her go. They don't want trouble.
zh_cn: 但他们想要放她走，他们不想有麻烦。

source: "Perhaps if I pay for these things now? " she asks.
zh_cn: “或许，如果我现在为这些东西付钱呢？”她问。

source: When she reaches her car, Helen is shaking too hard to insert the key into the car door.
zh_cn: 走到她车那儿时，海伦抖得太厉害了以至于钥匙都插不到门上。

source: She stands still, taking deep, gulping breaths, willing herself to calm down.
zh_cn: 她静静地站着，大口地深呼吸，希望自己平静下来。

source: That was too close.
zh_cn: 太紧迫了。

source: They had almost called Daniel.
zh_cn: 他们差点就打电话给丹尼尔了。

source: The thought makes her light-headed.
zh_cn: 这想法让她头晕。

source: Her husband is a man of principle and firm opinions.
zh_cn: 她丈夫是个有原则、信念坚定的人。

source: A strong man, which is why she married him.
zh_cn: 一个强大的男人，这是她嫁给他的原因。

source: He seemed the type of man who would take care of her. And he has.
zh_cn: 他象是那种会照顾她的男人，而他确实也这样做了。

source: But his view of the law is simple and punitive.
zh_cn: 但他对法律的观点却是简单而严苛的。

source: He thinks that teenage gang members who commit murder should be executed, that fourteen-year-old thieves should be tried as adults.
zh_cn: 他认为犯了谋杀罪的少年帮派成员应该被执行死刑，那些十四岁的小偷应当作为成年人被审判。

source: Only yesterday they had disagreed over a youth arrested for stealing a bottle of cider in a local off-license.
zh_cn: 就在昨天他们还为一个因在当地一家执照卖酒的商店里偷了一瓶苹果酒而被逮捕的年轻人意见不合。

source: "It was an initiation thing," Helen had said. "His mother's a crack head.
zh_cn: “那是一种入会仪式，”海伦说，“他母亲是个瘾君子。

source: He wants to be part of the gang. He wants a family."
zh_cn: 他想成为帮会的一员，他想有个家。”

source: Daniel had given her a long look.
zh_cn: 丹尼尔看了她很久。

source: "He's probably been unhappy and hungry all of his life," Helen added.
zh_cn: “他一生中可能一直是不幸的、饥饿的，”海伦补充说。

source: "Nobody's hungry in this country, " Daniel said. He actually believed it. "You heard of Benefits?"
zh_cn: “这个国家里没有人是饥饿的，”丹尼尔说，他真的是这样认为的，“你听说过劳保福利吗？”

source: Helen thought of the people in the literacy programme ¨C young and old, struggling with so many demons.
zh_cn: 海伦想起扫盲班上的人，年轻的和年老的，在和这么多邪恶的事物抗争着。

source: Hunger was not unknown.
zh_cn: 饥饿不是无人知晓的。

source: Though her teenage pupils were more likely to eat badly than not at all, their problems went far beyond an inability to read or write.
zh_cn: 尽管她十几岁的学生更可能是吃不好，而不是没饭吃，他们的问题远远不止没有读写能力。

source: Daniel knows little about the literacy programme.
zh_cn: 丹尼尔对扫盲班知之甚少。

source: He believes she teaches pensioners how to use a computer.
zh_cn: 他认为她在教领补助金生活的人怎么用电脑。

source: He would not understand Amanda, the girl who carries a kitchen knife to make small cuts in her wrists when she is stressed.
zh_cn: 他不会明白阿曼达，那个在压抑时拿餐刀在手腕上割小伤口的女孩。

source: Or Zak, the boy with HATE tattooed on his forehead.
zh_cn: 或者扎克，那个在额头上纹‘恨’字的男孩。

source: When she first met Daniel, he was studying law and she was passionately involved in a course on Writing and Madness.
zh_cn: 当她初次遇见丹尼尔时，他正学习法律，而她正充满热情地醉心于一门关于写作和疯狂的课程。

source: She would quote Rimbaud, Breton, Artaud, Foucault.
zh_cn: 她会引用兰波（Rimbaud，法国诗人）、勃雷东（Breton，法国诗人和文学理论家）、阿尔托（Artaud，法国诗人、评论家、翻译家、戏剧演员）、福柯（Foucault，法国哲学家和“思想系统的历史学家”）。

source: He teased her for taking this "foreign" literature seriously.
zh_cn: 他取笑她对这个“外国”文学太认真了。

source: He made her feel stupid for liking it, stupid for understanding it.
zh_cn: 他让她觉得喜欢它很愚蠢、理解它很愚蠢。

source: An irony that did not occur to her until much later.
zh_cn: 直到很久以后她才想到那是一件讽刺的事。

source: There are many things, she admits now, that Daniel does not understand.
zh_cn: 有很多事，她现在承认，丹尼尔不理解。

source: Things that are grey, with edges that are undefined, confuse him.
zh_cn: 灰色的事、边界不明的事，都让他困惑。

source: He would not understand what had happened today in the department store.
zh_cn: 他不会理解今天在百货商店发生的事。

source: In the newly decorated bedroom of her immaculate suburban home, Helen places the earrings and scarf in the locked trunk with the other shoplifted items.
zh_cn: 在她郊外洁净的家中新装修的卧室里，海伦把耳环和围巾放进上锁的箱子里，与其它从商店里偷来的东西放在一起。

source: There are hundreds of them now.
zh_cn: 现在有几百件了。

source: Many hundreds.
zh_cn: 好几百。

source: She calls them her gifts to the dark gods.
zh_cn: 她把它们叫做给黑暗之神的礼物。

source: She knows that it is the dark gods who turn the wheels of a tricycle and send the toddler screaming into traffic, the dark gods who guide children to falling fences, hidden currents and smiling strangers with death in their black hearts.
zh_cn: 她知道是黑暗之神转动了三轮车的车轮，把那个初学走路的孩子尖叫着送进车流，是黑暗之神指引孩子们到坠落的栅栏、暗流和面露微笑却包藏祸心的陌生人那里。

source: She cannot afford to stop now, after such a soft, uneventful life.
zh_cn: 她现在停不下来了，在这么温和、平静的生活之后。

source: Who knows what vengeance the dark gods might take?
zh_cn: 谁知道黑暗之神会给什么样的报复？

source: She can't remember exactly when it began.
zh_cn: 她记不起确切是什么时候开始的。

source: It was soon after Chloe and Nick left for university, when she quit her job at the advertising company.
zh_cn: 是在克洛伊和尼克去上大学后不久，在她辞去广告公司的工作时。

source: When she became, as Daniel describes her, a lady of leisure.
zh_cn: 当她成为，如丹尼尔所说的，一个悠闲夫人时。

source: "We can afford it, sweetheart.
zh_cn: “我们负担得起，亲爱的。

source: Do charity work or something.
zh_cn: 做做慈善工作什么的。

source: No need for you to stress out in advertising."
zh_cn: 不需要你在广告上承受压力。”

source: It started in Marks and Spencer's food hall: she stole a chocolate bar at the counter.
zh_cn: 这种行为开始于玛莎百货（Marks and Spencer）的美食厅：她在柜台上偷了一块巧克力。

source: A week later she took a magazine.
zh_cn: 一个星期后她拿了一本杂志。

source: It grew to two items a week.
zh_cn: 渐渐变成一个星期两件。

source: The rules gradually became more complex and demanding.
zh_cn: 规则逐渐变得更复杂、苛刻。

source: The rule now is: two items a week by Friday at three in the afternoon.
zh_cn: 现在规则是：星期五下午三点前每星期两件。

source: The items have to be from the same store, on the same floor, and they have to be different.
zh_cn: 东西要来自同一家商店，在同一楼层，还必须是不同的物品。

source: Two scarves, for example, won't do.
zh_cn: 比如说两条围巾，是不行的。

source: Today's items, the pretty scarf, the silly earrings, don't qualify because she has paid for them.
zh_cn: 今天的物品，漂亮的围巾、傻气的耳环不算数，因为她给它们付钱了。

source: The problem now is that she is behind.
zh_cn: 问题是现在她落后了。

source: She is two items behind.
zh_cn: 她落后了两件物品。

source: And it is already Thursday.
zh_cn: 现在已经是星期四了。

source: Tomorrow then. At the Mall.
zh_cn: 那就在明天，在商场。

source: "Meet me for lunch tomorrow?" Daniel asks, as they have dinner. "That client we met at the Algarve.
zh_cn: “明天一起吃午饭吧？”他们吃晚饭时丹尼尔问，“我们在阿尔加维（Algarve）遇到的那个客户。

source: John Stanton? He's in town with his wife. " Helen stares.
zh_cn: 约翰·斯坦顿？他和他妻子在城里。” 海伦睁大了眼睛直盯着。

source: "Tomorrow?" she repeats. "Where?"
zh_cn: “明天？”她重复道，“哪里？”

source: "The Blanc place."
zh_cn: “布兰克地区。”

source: He studies her expression.
zh_cn: 他仔细观察她的表情。

source: "Busy day?" he asks. "Hair appointment?"
zh_cn: “没空？”他问，“美发预约？”

source: He laughs.
zh_cn: 他大笑。

source: There is a strange pride in the way he teases her about her empty, frivolous days.
zh_cn: 在他取笑她空虚、琐碎的日子的方式里有一种奇怪的骄傲。

source: He is the sole breadwinner now.
zh_cn: 他现在是唯一一个赚钱养家的人。

source: "No problem.
zh_cn: “没问题。

source: The Blanc place it is," she says.
zh_cn: 就是布兰克地区了。”她说。

source: But Helen is seething.
zh_cn: 但是海伦心急如焚。

source: That means the local mall is out.
zh_cn: 那意味着当地的商场要排除在外了。

source: That means it has to be the city centre again.
zh_cn: 那意味着又要是市中心了。

source: She was there last week, when that middle-aged businessman followed her around.
zh_cn: 她上星期在那里，那时那个中年商人跟在她左右。

source: She knew he was plain-clothes security.
zh_cn: 她知道他是便衣保安。

source: He had the look.
zh_cn: 他有那种神色。

source: She was carrying her Debenham's bag; she always carries a department store bag with a number of purchased items inside it.
zh_cn: 她拎着德贝纳姆（Debenham）的袋子；她总是拎着一个百货商店的袋子，里面放着买的许多东西。

source: A basic rule.
zh_cn: 这是一个基本原则。

source: And she was dressed well and carrying a good quality handbag.
zh_cn: 而且她衣着考究，拿着一个高品质的手提包。

source: Her new one is Italian and black linen, full of expensive clues to background and breeding.
zh_cn: 她的新包是意大利的，黑色亚麻的，充满对背景和教养的豪华说明。

source: Intimidation.
zh_cn: 胁迫。

source: The guy hadn't been intimidated though.
zh_cn: 那个家伙还没受到过胁迫。

source: He'd stayed close.
zh_cn: 他跟得很紧。

source: In the city centre the following day, Helen avoids Harvey Nicks, too many close calls there, and heads to House of Fraser.
zh_cn: 第二天在市中心，避开了哈维·尼克斯（Harvey Nicks），在那里她有太多次侥幸逃脱，海伦直奔弗雷泽商行（House of Fraser）。

source: A lanky kid in sweats shoots up from nowhere.
zh_cn: 一个穿运动服的瘦长个年轻人不知从哪里冒出来。

source: He is behind her as she enters the store.
zh_cn: 她走进商店时他在她后面。

source: He is still there at the jewellery counter.
zh_cn: 在珠宝柜台他还在那儿。

source: She is certain he is security; she has learned to spot them.
zh_cn: 她确定他是保安；她已经学会认出他们了。

source: Helen avoids looking at him.
zh_cn: 海伦避免看他。

source: She picks up a scarf, replaces it, studies earrings, bracelets, tries one of them on her wrist, then puts it back.
zh_cn: 她拿起一条围巾，放回原处，仔细观看耳环、手镯，在手腕上试了其中一只，然后放回去。

source: He waits, watching.
zh_cn: 他等着，看着。

source: When she takes the escalator, he is four people behind her.
zh_cn: 当她乘上自动扶梯时，他隔着四个人跟着她。

source: Lingerie will smoke him out, she knows that.
zh_cn: 女式贴身内衣会把他赶跑，她知道的。

source: It's worked well before.
zh_cn: 以前很奏效。

source: Plain-clothes store detectives stand out in the red satin thongs and French bra department.
zh_cn: 商店的便衣侦探在红色绸缎丁字裤和法式文胸部太扎眼了。

source: But he's behind her.
zh_cn: 但他在她后面。

source: She can feel him.
zh_cn: 她能感觉到他。

source: She glances at her watch and catches her breath.
zh_cn: 她匆匆看了一眼手表，倒吸一口气。

source: She is almost out of time.
zh_cn: 她几乎没时间了。

source: She has to be at the restaurant in half an hour.
zh_cn: 她必须半小时后到餐馆。

source: "May I help you, ma'am?" asks a salesgirl.
zh_cn: “您要买点什么，夫人？”一个女售货员问。

source: She is a sweet Barbie doll of a girl, about Chloe's age.
zh_cn: 她是一个芭比娃娃式的女孩，和克洛伊年龄差不多。

source: Security kid must have alerted her.
zh_cn: 保安小伙一定是让她警惕了。

source: "Just looking," Helen smiles, panic starting in her chest.
zh_cn: “只是看看，”海伦微笑着，她心中开始恐慌。

source: Her heart begins pounding.
zh_cn: 她的心开始怦怦跳。

source: She is not going to be able to do it.
zh_cn: 她要做不成了。

source: The kid stands only ten yards away, and he is watching openly.
zh_cn: 那个小伙子就站在十码开外，而且他在公然监视了。

source: She meets his gaze, then tries to smile.
zh_cn: 她迎上他的盯视，然后试图微笑。

source: "Hello there," she says.
zh_cn: “你好，”她说。

source: He turns away.
zh_cn: 他转身走开了。

source: She is ten minutes late to the restaurant and Helen is damp with fear.
zh_cn: 海伦迟了十分钟去餐馆，而且恐惧得情绪低落。

source: It is Friday and already 1:30 p.m. It will have to be items from the restaurant: knives, forks, saltshakers.
zh_cn: 今天是星期五，已经是下午一点三十分了。只能是从餐馆拿的东西了：刀子、叉子、盐瓶。

source: She has done it before but it is awkward, and this is her husband's client.
zh_cn: 她以前干过，但太难了，而且这是她丈夫的客户。

source: John Stanton and his wife, Barbara, are already seated at the table, sipping aperitifs.
zh_cn: 约翰·斯坦顿和他的妻子芭芭拉已经坐在桌旁了，小口喝着开胃酒。

source: Barbara has the kind of drink no one orders in the city anymore: a martini with an olive.
zh_cn: 芭芭拉要的是城里没人再点的那种饮料：一种放橄榄的马提尼酒。

source: His looks like a scotch.
zh_cn: 他的看起来像是一种苏格兰酒。

source: Daniel regards her with some disapproval.
zh_cn: 丹尼尔有点不满地看着她。

source: "Sorry," she says. "Traffic."
zh_cn: “对不起，”她说，“堵车。”

source: She shakes hands and smiles but she is starting to tremble.
zh_cn: 她握手，微笑，但她开始发抖。

source: She is running out of time.
zh_cn: 她要没时间了。

source: It will soon be too late.
zh_cn: 很快就太晚了。

source: Barbara Stanton has the perfectly manicured and coiffed look of the suburban matron.
zh_cn: 芭芭拉·斯坦顿有着郊区主妇指甲修剪整齐、头发梳理光洁的完美样子。

source: A generation ago her type of woman would have had blue hair.
zh_cn: 一代人以前她那种类型的妇女会有蓝色的头发了。

source: Her hair is streaked blonde, her chin tucked, her skin spa-pampered.
zh_cn: 她的头发是挑染的金色，她的下巴塌陷，她的皮肤是用温泉水疗保养过的。

source: She smiles a white, wide smile.
zh_cn: 她笑容灿烂。

source: "Lovely to meet you," she says.
zh_cn: “很高兴见到你，”她说。

source: The men talk business, the women chat about children.
zh_cn: 男人们谈生意，女人们聊孩子。

source: The competition is equally fierce on both ends of the table.
zh_cn: 桌子两头的竞争同等激烈。

source: "Your daughter's at Cambridge?" asks Barbara.
zh_cn: “你女儿在剑桥？”芭芭拉问。

source: "Yes. Chloe's choice.
zh_cn: “是的。克洛伊的选择。

source: And Nick's at Edinburgh. Medical school.
zh_cn: 尼克在爱丁堡。医学院。

source: As far away from home as they could get! You have two sons?"
zh_cn: 他们能离家多远就离了多远！你有两个儿子？”

source: "Yes. Both Oxford," says Barbara, her smile victorious.
zh_cn: “对，两个都在牛津。”芭芭拉说，面带胜利的微笑。

source: They exchange photographs, making admiring noises.
zh_cn: 她们交换照片，发出赞叹的声音。

source: "Chloe looks just like you," Barbara says.
zh_cn: “克洛伊看起来和你一模一样，”芭芭拉说。

source: Helen cannot see it.
zh_cn: 海伦倒看不出来。

source: Her bright, lovely daughter, Chloe: so confident, so creative.
zh_cn: 她聪慧、可爱的女儿克洛伊：那么自信，那么有创造力。

source: She is amazed that she produced these children.
zh_cn: 她很吃惊自己养出了这些孩子。

source: The gene pool had obviously sucked more from Daniel's side during their formation; all the classy traits from his Patrician Berkshire family are visible.
zh_cn: 在他们形成的过程中基因库很明显地从丹尼尔那一边吸收了更多；来自他贝克郡贵族家庭的所有优等特征都很显著。

source: Her own working class genes are not in evidence.
zh_cn: 她自己的工人阶级基因却不明显。

source: Helen lifts the fish knife, turns it over, and places her hand over it.
zh_cn: 伦举起鱼刀，翻过来，然后把手放在上面。

source: The waiter appears with salad, and takes the knife away with a swift, smooth stroke.
zh_cn: 侍者端着色拉出现了，快速而优雅地一抽就把刀子拿走了。

source: Too late.
zh_cn: 太晚了。

source: They are too efficient here.
zh_cn: 他们在这一点上太高效了。

source: She looks at the dessert spoons.
zh_cn: 她看着甜点匙。

source: Possibly, possibly.
zh_cn: 或许，或许。

source: She is sweating.
zh_cn: 她在冒汗。

source: Her blouse is sticking to her back and she can feel her hair, damp, curling against her neck.
zh_cn: 她的衬衫粘在背上，她能感觉到她的头发已经湿了，蜷曲着贴在脖子上。

source: Her heart is starting to pound, a hard nauseating pounding.
zh_cn: 她的心开始怦怦地跳，强烈的、令人作呕的心跳。

source: Panic attacks, her therapist, Martha Kim, calls them.
zh_cn: 她的医师玛莎·金称它们为恐慌发作。

source: "Terrifying but temporary," she had said to Helen when they first began.
zh_cn: “可怕不过却是暂时的，”在她们第一次开始时她对海伦说。

source: "I think I'm going to die; that's how it feels."
zh_cn: “我觉得我要死了；感觉就是这样。”

source: "No-one dies of panic attacks.
zh_cn: “没有人死于恐慌发作。

source: Stay calm until it passes."
zh_cn: 保持镇定直到它过去。”

source: Helen has not told Martha the reason for these attacks.
zh_cn: 海伦没有告诉玛莎这些发作的原因。

source: The stealing, the rigid rules about the stealing, is something she has never shared with anyone.
zh_cn: 偷窃、关于偷窃的严格规则，是她从未与任何人分享的事。

source: How could Martha, with her small, empathetic smile, understand about dark gods?
zh_cn: 面带浅浅的同情微笑的玛莎怎么能明白关于黑暗之神的事？

source: When the waiter asks about dessert, Helen pretends an interest only to keep the silverware on the table.
zh_cn: 当侍者询问甜点的时候，海伦假装有兴趣，只是要把银器留在桌上。
